# При введенні числових даних часто зустрічається типова проблема:
# користувач вводить текст замість чисел.
# При спробі перетворити дані в int генерується виняток ValueError.
# Напишіть функцію, яка приймає два числа,
# шукає їх суму і виводить результат. Перехопіть виняток TypeError,
# якщо будь-яке із вхідних значень не є числом,
# і виведіть зручне повідомлення про помилку. Протестуйте функцію:
# спочатку введіть два числа,
# а потім введіть текст замість одного з чисел.


def summing():
    """Function that sums two numbers"""
    try:
        first, second = input('Введіть два числа через пробіл: ').split(' ')
        return int(first) + int(second)
    except (ValueError, TypeError) as err:
        print(f'\nПомічена помилка: {err.__class__}.')
        print('Причина:', err)
        return 'Розрахунок не відбувся через некоректно введені данні.\n'


if __name__ == '__main__':
    while True:
        result = summing()
        print(result)
        if result == 0:
            print('END')
            break




